/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rabderus <rabderus@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/27 16:18:21 by rabderus          #+#    #+#             */
/*   Updated: 2021/10/27 16:35:55 by rabderus         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// узнаем длину строки

size_t	ft_strlen(const char *str)
{
	size_t	i;

	i = 0;
	while (str[i])
		i++;
	return (i);
}

// int main()
// {
//     // Массив с исходной строкой
//    char str[11] = "0123456789";

//    //Определение длины строки и вывод результата на консоль
//    printf ("%lu\n", ft_strlen(str)); // наверно потому что size_t

//    return 0;
// }